import React from 'react';
import {
  StyleSheet,
  Text,
  View,
  Image,
  ScrollView,
  TouchableOpacity,
} from 'react-native';
import {Card, ListItem, Button, Icon, Avatar} from 'react-native-elements';
import MapView, {
  PROVIDER_GOOGLE,
  Polygon,
  Polyline,
  LatLng,
  Marker,
} from 'react-native-maps';
import {SafeAreaView} from 'react-native-safe-area-context';

import * as data from './user.json';
//import story from './survivalStory.txt';

export default class Boxes extends React.Component {
  render() {
    return (
      //  <View>
      <ScrollView>
        <View style={styles.box}>
          {
            <View style={{height: 350}}>
              <ScrollView style={{flex: 1}} nestedScrollEnabled={true}>
                <Text style={{fontSize: 18}}>
                  סעדיה בהט נולד בשנת 1928 באליטוס שבליטא למנדל (מנחם) וג'ניה
                  (שיינה-יפה) בוקשיצקי. אמא ואבא, אחותי ליליה ואני, ארבעתנו
                  יושבים על הספה בחדר האורחים, כולם מחובקים, כולם מתנשקים זה עם
                  זה. אין דיבורים, אולי רק שמות חיבה נשמעים בלחש, והחום והרוגע
                  עוטפים את הכל... כנראה שהחום הזה הספיק לי אפילו כעבור עשור,
                  כשהקרח נשבר תחתי ושקעתי בביצה כמעט עד המותן, מלפנַי חברי
                  לסחיבת חבילת ענפי העץ מושך קדימה, ומאחורי השומר מניף את אלתו
                  וצווח "שנל! שנלר!" – שלג מסביב וכפור, ורגלי רטובות, אך בפנים
                  עוד נותר כנראה מהחום ההוא... והצלחתי להמשיך. אביו של סעדיה היה
                  עורך דין ויסד יחידת מכבי אש מתנדבים באליטוס. הוא פיתח מאגרים
                  תת קרקעיים של מי כיבוי, שהיו חיוניים לעיירות וכפרים ללא מערכות
                  מים זורמים. הוא פיתח בידוד שימנע קפיאתם של המים בטמפרטורות
                  נמוכות והשתמש בפיתוח כימי חדשני למניעת צמיחתן של אצות במים,
                  אצות שהיו עלולות לסתום את מערכת הכיבוי. על פעולות הכיבוי
                  ופיתוחיו קיבל אותות הצטיינות לאומיים. האב ייסד את משטרת אליטוס
                  ופיקד עליה, והיה ממייסדי מנהלת העיר וחבר המועצה. לבנו קרא על
                  שם סעדיה גאון. האם היתה אופה מומחית, רוקמת ומספרת סיפורים.
                  בבית דיברו בני המשפחה יידיש. בחוץ דיברו ליטאית ולמדו גרמנית
                  ורוסית. סעדיה למד בבית הספר העברי "יבנה" ושם למד מעט עברית.
                  לאחר פרוץ מלחמת העולם השניה עברה משפחתו של סעדיה לווילנה, שם
                  החל סעדיה ללמוד בבית ספר ליטאי, ולמד גם פולנית. עם פלישת
                  הגרמנים לליטא ביוני 1941 הופצצה העיר. הרחוב בו שכן הבית נפגע
                  קשה. סעדיה התבגר בן-לילה. יהודים נחטפו לעבודה ונרצחו מדי יום.
                  סעדיה נשלח לעמוד בתורים למזון ונלחם על המזון המועט מול העומדים
                  בתור. בספטמבר 1941 הוכנסה המשפחה לגטו וילנה. אבא לבש חליפה ועל
                  הז'קט ענד את המדליות שקיבל מהליטאים בעד פועלו הרב, בעד עזרה
                  לזולת והצלת חיי אנשים. הוא ידע ששוטרים ליטאים יאכפו את הגירוש,
                  ורצה לגרום להם לפחות להבין קצת ולהרגיש למה הם נותנים יד. באחת
                  האקציות בגטו נרצח אביו של סעדיה. אמו הצליחה להציל אותו ואת
                  אחותו. "איבדנו את אבא אך בקושי היה לנו כוח נפשי או רגשי
                  להתאבל. ההישרדות דרשה את מרבית האנרגיה שעוד נותרה לנו." סעדיה
                  החל לעבוד כשוליית חשמלאי בבית המלאכה של הגטו וניצל כל רגע פנוי
                  ללימוד נגרות, מסגרות ונפחות. הוא סיים בהצטיינות קורס חשמל
                  ומכניקה לשוליות וכפרס קיבל קילו סוכר. אמו עבדה מחוץ לגטו
                  והבריחה מזון ככל יכולתה. בספטמבר 1943 דרשו הגרמנים גברים
                  מתנדבים למחנות העבודה באסטוניה. סעדיה שרד חיפוש אחד במחבוא, אך
                  עם החיפוש הבא נשמעו פיצוצים בגטו. סעדיה סבר שבגלל היעדר
                  מתנדבים הגרמנים מפוצצים את הגטו והחליט להתנדב. נפניתי אחורה
                  וראיתי את עיניה של אמא. היא הרימה את ידה ונפנפה לשלום. לא
                  ידעתי אז שאלו המבט ונפנוף היד האחרונים של אמי האהובה, שאראה
                  בחיי. סעדיה הוסע ברכבת למחנה וייווארה (Vaivara) באסטוניה.
                  הייתי מיובש. מת לשתות. הסתכלתי על השלוליות המסריחות מסביב. זה
                  מים – מה שדרוש לי יותר מכל דבר אחרי מספר ימים שלא שתיתי בכלל.
                  אבל ידעתי שהשלוליות שמסביב משמשות גם כשירותים ציבוריים. מי
                  שישתה ממי האפסיים האלה ימות בהקדם ואני רציתי לחיות. לאחר
                  כשבועיים הוצעד סעדיה 50 קילומטרים ביער למחנה העבודה ארדה
                  (Ereda), שם הועבד ביערות בכריתת עצים ושרד סלקציות רבות. משם
                  הועבר בצעדה לילית בשלג למחנה העבודה קורומאי (Kuromai), ומשם
                  הוצעד שוב, הפעם למחנה ויויקוני (Vivikoni), גם בו עבד בכריתת
                  עצים. סעדיה השיג אולר, גילף מקל והצליח להקנות לו מגוון צבעים
                  על ידי טכניקת חריכה. כשנודע על כך לגרמנים, הטילו עליו לייצר
                  להם מקלות הליכה וקבעו מחיר של חצי כיכר לחם למקל. בהמשך הוא
                  הועבר למחנה סוסקי (Soski), בצפון מזרח אסטוניה. כל בוקר הלך 15
                  קילומטר לעבודה בהנחת מסילת ברזל בביצה. כל ערב חזר באותה דרך.
                  הצעדות עברו ליד חצרות איכרים. לעתים הצליח סעדיה לקחת מזון
                  שנשמר עבור החזירים – קליפות תפוחי אדמה ועלים רקובים למחצה. על
                  אסירי המחנה הוטל לאסוף את גוויות הצועדים שנספו בצעדה. למעלה
                  ממחצית האסירים נספו בתוך שלושה חודשים. כשהתפרקו נעליו של
                  סעדיה, עמד יחף בשלג במסדרים. עם התקרבות הצבא האדום הוצעד סעדיה
                  לטאלין ובאניה הובא לגרמניה. הלחם שלו נגנב ובימי המסע הוא היה
                  בצום. בצעדה של 35 קילומטרים הוא הובא למחנה הריכוז שטוטהוף.
                  סעדיה הוכנס לצריף הילדים ושרד עם עוד שישה ילדים באקציה שבה
                  נלקחו כל יתר 507 הילדים שבצריף להשמדה מידית בבירקנאו. במחנה
                  פגש סעדיה את דודו, ד"ר אברשה קרונזון. השניים הוסעו למחנה
                  דנציג-בורגראבן (Danzig–Burggraben), שם עבד סעדיה בטיפול בפסי
                  רכבת במספנה. לאחר מכן עבד בריתוך במספנת צוללות. עם הבאתם של
                  חולי טיפוס הבהרות למחנה, הצטוו הרופאים, אברשה וידידו ד"ר
                  קלבנוב, לטפל בחולים ונדבקו גם הם במחלה. עם התקרבות הצבא האדום
                  הוצאו האסירים לצעדת מוות מערבה. סעדיה וד"ר קלבנוב תמכו באברשה
                  לאורך הצעדה. כשהגיעו הצועדים למחנה בגודנטוב (Godentow) השיג
                  סעדיה מעט תפוחי אדמה לדודו ורחץ אותו. כך נדבק גם הוא בטיפוס.
                  עם התקרבות הצבא האדום העבירו הגרמנים את סעדיה, דודו וד"ר
                  קלבנוב החולים לצריף קטן ומבודד. האסירים שעוד יכלו ללכת, הוצבו
                  למסדר והוצעדו מהמחנה. פתאום נשמעה אש מקלעים כבדה וממושכת.
                  חשבנו שרוצחים את כולם ויבואו לחסל גם אותנו, אבל הכל השתתק.
                  ביום השלישי בצריף הגיע פולני והביא לשלושה חתיכת בשר מסוס מת
                  שהיה בקרבת מקום. השלושה שברו ספסל שהיה בצריף, הדליקו אש, צלו
                  ואכלו פיסות בשר. למחרת בצהריים – 10 במרס 1945 – נכנס חייל רוסי
                  לצריף. החייל פתח את כפתורי מעילו, שלף מכיס פנימי מימיה קטנה,
                  שטוחה. הוא פתח את הפקק והגיש לכל אחד משלושתנו לגימת וודקה. הוא
                  יצא מהצריף וסגר את הדלת, ואנחנו התחלנו לקלוט, שהשואה לגבינו
                  נגמרה! לאחר השחרור ניצלו סעדיה, אברשה וד"ר קלבנוב מספר פעמים
                  ממוות: בדרכם מהמחנה נפרדו בעל כרחם, אך במקרה הגיעו לאותו בניין
                  ולאותה הדירה בעיר לאואנבורג (Lauenburg in Pommern), כיום
                  לנבורק (Lębork) שבפולין, שם שהו באפס כוח, חולים במחלת הטיפוס.
                  רבים מהיהודים ניצולי השואה ששהו בבניין מתו במחלה זו. כאשר עלה
                  הבניין באש הצליחו השלושה להימלט. השוהים בקומות היותר גבוהות
                  נספו. בהמשך סעדיה היה מתורגמן במשק חקלאי גרמני ולאחר מכן מנהלו
                  של המשק, מטעם בית חולים צבאי רוסי. בעזרת הדואר הצבאי נודע
                  לסעדיה שאחותו ליליה שרדה (היא עלתה ארצה ב 1970). כל משפחתו של
                  אברשה נשרפה למוות בנסיגת הגרמנים מגטו קובנה. כעבור כמה חודשים
                  סעדיה הגיע לברלין וצורף לכ-30 ילדים ניצולי שואה. הקבוצה נשלחה
                  לקאיי-סור-אור (Cailly-sur-Eure) בצפון צרפת ושם הוכנסה לבית
                  יתומים יהודי. לרובנו היה המוסד מעין בית ראשון אחרי שנות השואה.
                  חיים עם סדר יום קבוע, אוכל לשובע, מיטות נקיות ומסודרות, היו
                  משהו חדש וזר. החיים החדשים לכולנו והשאיפה להגיע לארץ ישראל
                  מילאו את הווייתנו עד כדי כך שאף אחד לא עסק במה שעבר עליו.
                  קבוצתו של סעדיה הועברה למרסיי ובפברואר 1946 עלתה הקבוצה על
                  האנייה "קהירו" שיצאה לארץ ישראל. מצד אחד האנייה התחילה להתרחק
                  מכל האימים והכאב המודחק שבתוכי, ומצד שני, בעוד רגע היא תסובב
                  את חרטומה מזרחה ותתחיל את המסע שלי לכל מה שיכולתי לחלום עליו
                  אי פעם. זה היה אחד הרגעים המרגשים בחיי, תערובת של הכי גרוע עם
                  התקוות הכי טובות. האנייה קרבה אל חופי הארץ. המראה היה יותר
                  מרגש משתיארנו לעצמנו. אף אחד לא חשב אפילו ללכת לישון. במשך
                  שעות רקדנו הורה מסביב לסיפון האנייה ועינינו נעוצות באורות של
                  חיפה. סעדיה הגיע ל"משק הפועלות" בפתח תקווה. "שם נולדתי מחדש",
                  כתב. "נכנסתי למשק ביידיש ויצאתי בעברית." רוב חניכי המשק היו
                  יתומי השואה, ומוריהם הקפידו על חינוך חקלאי ועל לימודים
                  עיוניים, אך בעיקר על חינוך ציוני. סעדיה התגייס ל"הגנה" ועם
                  פרוץ המאורעות התנדב לפלמ"ח והוצב בגדוד החמישי של חטיבת הראל.
                  הוא היה ממלווי השיירות לירושלים ולחם על הבקעת הדרך אל העיר
                  ובקרב על שייח' ג'ראח, בו נפצע. לאחר ששוחרר מאשפוז הוצב בקורס
                  מ"כים. הוא אימן כיתת עולים חדשים, לחם בקרבות להרחבת פרוזדור
                  ירושלים דרומה ופיקד על כיתות בקו הראשון בחזיתות ירושלים. במבצע
                  חורב פיקד על יחידתו בכח שחצה דרכים שנחשבו בלתי עבירות, לחם נגד
                  שיירה צבאית מצרית באזור רפיח והחזיק בקו החזית מול התקפות
                  מצריות. אני מרגיש שתרמתי, אמנם באופן צנוע, להקמת מדינת ישראל
                  שכה יקרה וחשובה לי. לכן גם תקופה קשה זאת שמורה בזיכרוני לטובה
                  ואפילו לגאווה. היא אינה מתווספת לזיכרונות השואה, למרות שבשתי
                  התקופות הרבו לירות עלי כדי להמית אותי – כמובן, בקנה מידה שונה
                  לגמרי. הגדוד החמישי איבד יותר מ-22% מלוחמיו וזה המון בהשוואה
                  לצה"ל, אבל יהדות ליטא איבדה 95% ואני, כאמור, הייתי במקום
                  קיצוני גם לגבי הנתון הסטטיסטי הזה. סעדיה עלה להתיישבות בתל גזר
                  עם בני גרעין "היוגבים", הדריך במשק הפועלות בפתח תקווה ולאחר
                  מכן עבד בשרטוט ובמדידות. הוא למד הנדסת מכונות בטכניון, עבד
                  בהולנד ועם שובו ארצה החל לעבוד ברפא"ל. במקביל למד אמנות, יצר
                  פסלים והציג מיצירותיו בתערוכה. סעדיה היה, במשך 37 שנים, איש
                  מחקר ופיתוח ברפא"ל, ראש יחידה לפרויקטים ביטחוניים ומהנדס מחקר
                  ראשי בתחום לוחמת היבשה. הוא היה ממפתחי טיל ה"לוז", משגרי קרקע,
                  משגר מוטס, משגר נייד על טנק ועל נגמ"ש ועוד. הוא זכה בשני פרסי
                  רפא"ל ובפרס ביטחון ישראל - הפרס הגבוה ביותר בתחום בטחון המדינה
                  הניתן לאזרחים, על פרויקט פיתוח שפרטיו עדיין חסויים. סעדיה
                  הוזמן שלוש פעמים לאוניברסיטת סטנפורד כמנחה פרויקטים של
                  סטודנטים לתואר שני, במעמד של פרופסור אורח. בשנת 1991 צורף
                  סעדיה למשלחת חיל החימוש לגרמניה. היה לנו מפגש במטכ"ל הגרמני
                  בבון. הגנרלים שלהם קפצו לדום והצדיעו לנו. ביום האחרון אחד
                  הקצינים הצעירים שלנו הסיע אותי מבון לשדה התעופה בפרנקפורט.
                  במשך כל ימי הדיונים לא היה לי זמן לחשוב על משמעות הסיור הזה
                  לגבי, אבל בזמן הנסיעה במכונית פתאום "נפל לי האסימון". שאלתי את
                  הקצין שהסיע אותי לדעתו – כמה עשיריות שניה הייתי נשאר בחיים
                  אילו הייתי נכנס למטכ"ל הגרמני בשנת 1941? אני חושב שבשבילי,
                  בתור ניצול שואה לא יכלה להיות סגירת מעגל יותר סמלית מהביקור
                  במטכ"ל הגרמני. ההתחייבות שלי לעבודה ברפא"ל הפכה בעיני גם חלק
                  מההתחייבות למשפחתי. לא אוכל להסתכל לנכדים שלי בעיניים, אם לא
                  אתרום ככל יכולתי לביטחון של המדינה שאותה הם "יקבלו ממני
                  בירושה". במקביל לעבודתו המשיך סעדיה ביצירתו האמנותית, אותה החל
                  עוד בתקופת השואה. עשרות תערוכות יחיד מעבודותיו הוצגו בארץ
                  ובחו"ל, ופסליו מוצגים באוניברסיטת סטנפורד, במכוני רפא"ל,
                  ביישובים בארץ ובחו"ל. הוא עיצב אנדרטאות ברחבי ישראל וזכה
                  בפרסים על יצירתו האמנותית. כבר זמן רב למדי שאפתי להציג תערוכה
                  בווילנה. בשנת 1943 הוציאו אותי משם כיהודי עלוב שנדון למוות
                  כמעט בטוח. היה בי רצון עז לחזור לשם כאמן גאה! עצם העובדה
                  שקיימתי תערוכה במוזיאון הלאומי של ליטא היתה מאוד משמעותית
                  בשבילי. כנער קטן מאליטוס לא יכולתי אפילו לחלום על זה. ואבא
                  שלי, שהיתה לו תרומה כל כך משמעותית ורב תחומית לליטא בתקומתה –
                  כשהיה צריך לקבל אות הצטיינות גבוה, נבלם בגלל יהדותו. עכשיו
                  הופעתי כנציג גאה של ישראל – ארצם של אותם היהודים, והליטאים
                  מחפשים את קרבתי. היתה בזה סגירה סמלית של כמה וכמה מעגלים.
                  בביקוריו בליטא קשר סעדיה קשרים חמים עם אמנים, עיתונאים,
                  מחנכים, תלמידים ומדינאים ליטאים, מהם רבים המנציחים את זכר
                  יהדות ליטא ואת זכר שואתה. המאפיינים העיקריים לאורך כל חיי היו:
                  מאמץ לממש את יכולותי ככל האפשר, הקמת משפחה ותרומה מרבית
                  למשפחתי ולמדינה. ומעל הכל שאפתי – לאהוב ולהיות ראוי לאהבה.
                </Text>
              </ScrollView>
            </View>
          }
        </View>
        <View style={styles.container}>
          <Text>Still testing</Text>
          <MapView
            provider={PROVIDER_GOOGLE}
            style={styles.miniMap}
            region={{
              latitude: parseFloat(data.paths[0].lat),
              longitude: parseFloat(data.paths[0].long),
              //latitude: 37.78825,
              //longitude: -122.4324,
              latitudeDelta: 0.015,
              longitudeDelta: 0.0121,
            }}>
            <Marker
              coordinate={{
                latitude: parseFloat(data.paths[0].lat),
                longitude: parseFloat(data.paths[0].long),
              }}
              pinColor={'purple'} // any color
              title={'title'}
              description={'description'}
            />
            <Polyline
              coordinates={parsPathsIntoListOfCoo(data.paths)}
              strokeColor="#000" // fallback for when `strokeColors` is not supported by the map-provider
              strokeColors={[
                '#7F0000',
                '#00000000', // no color, creates a "long" gradient between the previous and next coordinate
                '#B24112',
                '#E5845C',
                '#238C23',
                '#7F0000',
              ]}
              strokeWidth={6}
            />
            {/* <Marker
            coordinate={{ latitude : '31.0461' , longitude : '34.8516' }}
            image={require('../assets/pin.png')}
            /> */}
          </MapView>
        </View>
        <View>
          {parsPathsIntoListOfCoo(data.paths).map((l, i) => (
            <ListItem key={i} bottomDivider>
              <ListItem.Content>
                <ListItem.Title>
                  {l.latitude} {l.longitude}
                </ListItem.Title>
              </ListItem.Content>
            </ListItem>
          ))}
        </View>
        <View style={styles.fixToText}>
          <TouchableOpacity
            //onPress={buttonClickedHandler}
            style={styles.roundButton1}>
            <Text>Add</Text>
          </TouchableOpacity>
        </View>
      </ScrollView>
    );
  }
}
const parsPathsIntoListOfCoo = jsonPath => {
  var googleCoordinates = [];
  var coords = Object.keys(jsonPath).map(key => jsonPath[key]);
  coords.forEach(coord =>
    googleCoordinates.push({
      latitude: parseFloat(coord.lat),
      longitude: parseFloat(coord.long),
    }),
  );
  return googleCoordinates;
};

const styles = StyleSheet.create({
  miniMap: {
    height: 350,
    width: 410,
    //alignItems: 'center',
    justifyContent: 'flex-end',
    flex: 2,
    paddingLeft: 200,
  },
  box: {
    width: '95%',
    height: 380,
    padding: 5,
    margin: 10,
    borderRadius: 3,
    shadowColor: '#000000',
    shadowOpacity: 0.3,
    shadowRadius: 3,
    backgroundColor: '#ffffff',
    elevation: 3,
    paddingTop: 5,
  },
  container: {
    alignItems: 'center',
  },
  fixToText: {
    flexDirection: 'row',
    justifyContent: 'space-between',
    alignItems: 'center',
    paddingLeft: 350,
    position: 'absolute',
    paddingTop: 700,
    borderRadius: 100,
  },
  roundButton1: {
    width: 50,
    height: 50,
    justifyContent: 'center',
    alignItems: 'center',
    padding: 10,
    borderRadius: 100,
    backgroundColor: 'blue',
  },
});
